<h1> Recommendation Engine</h1>

As a plan for the company to increase it market share globaly, with a Recommendation engine that recommend products to customers can be a key for the company to archieve its objective.

In this notebook, I explore; - Python programming, - Data analysis using Pandas, - apply data transformation for rule mining, and perform market basket analsysis.

<h2>Task and dataset</h2>

In this notebook, I deployed the Market Basket Analysis (MBA) using Apriori algorithm to generate association rules for the MBA dataset.

Dataset:- I will be working with the 'Online_retail.zip'. The dataset contains the items bought in the company stores with each transaction ID. It includes the timestamp of the transaction.

In [7]:
# import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt; plt.rcdefaults()
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [13]:
#load the dataset using pandas package
#df = pd.read_csv('Online_retail.zip', sep='\t', dtype=np.str_)
df = pd.read_csv('Online_retail.zip')

In [15]:
# Prints the first five rows of the dataset
df.head()

,ProductKey,CustomerKey,SalesOrderNumber,ProductName,OrderQuantity,Price,OrderDate,Unnamed: 7
0,310,21768,SO43697,"Road-150 Red, 62",1,3578.2700,29/12/2010,NaN
1,346,28389,SO43698,"Mountain-100 Silver, 44",1,3399.9900,29/12/2010,NaN
2,346,25863,SO43699,"Mountain-100 Silver, 44",1,3399.9900,29/12/2010,NaN
3,336,14501,SO43700,"Road-650 Black, 62",1,699.0982,29/12/2010,NaN
4,346,11003,SO43701,"Mountain-100 Silver, 44",1,3399.9900,29/12/2010,NaN

In [17]:
# Let's check the dimention of the dataset
df.shape

(60398, 8)

<h3>Basic Data Analysis</h3>

Let's get familiar with the dataset. To gain some impressions, will try getting some counts for different columns.

In [22]:
num_uniq_dates =df['OrderDate'].nunique()
print("The number of unique dates is: ", num_uniq_dates)

The number of unique dates is:  1124